{
  "common_events": [
    {
      "age": 12,
      "name": "초등학교 졸업",
      "description": "초등학교 6년 과정을 마치고 졸업합니다. 졸업식에서는 친구들과 마지막 인사를 나누고, 선생님들에게 감사 인사를 전합니다. 졸업 후의 계획과 기대에 대해 이야기합니다. 졸업식장에서 친구들과 함께 사진을 찍고, 선생님께 감사의 편지를 전달합니다. 부모님과 함께 졸업 기념 저녁식사를 합니다.",
      "details": "졸업식장에서 친구들과 함께 사진을 찍고, 선생님께 감사의 편지를 전달합니다. 부모님과 함께 졸업 기념 저녁식사를 합니다.",
      "questions": ["졸업식에서 가장 기억에 남는 순간은 뭐였니?", "친구들과 헤어지는 것이 아쉽니?", "졸업 후 무엇을 하고 싶니?"]
    },
    {
      "age": 15,
      "name": "중학교 졸업",
      "description": "중학교 3년 과정을 마치고 졸업합니다. 졸업식에서는 중학교 생활 동안의 추억을 회상하고, 친구들과 함께 새로운 시작을 준비합니다. 고등학교 진학에 대한 준비와 걱정을 나눕니다. 졸업식에서 받은 상장을 부모님께 보여주고, 친구들과 함께한 추억을 이야기합니다.",
      "details": "졸업식에서 받은 상장을 부모님께 보여주고, 친구들과 함께한 추억을 이야기합니다.",
      "questions": ["중학교에서 가장 기억에 남는 일은 무엇이니?", "고등학교 진학에 대해 어떤 기대와 걱정을 가지고 있니?", "새로운 학교에서 어떤 목표를 세웠니?"]
    },
    {
      "age": 18,
      "name": "고등학교 졸업",
      "description": "고등학교 3년 과정을 마치고 졸업합니다. 대학 진학이나 사회 진출을 준비하며, 졸업식에서는 성년이 되어가는 자신을 돌아봅니다. 미래에 대한 꿈과 계획을 부모님과 공유합니다. 졸업식 후 친구들과 함께한 파티에서 느낀 점을 부모님께 이야기하고, 대학 생활이나 사회 생활에 대한 기대를 나눕니다.",
      "details": "졸업식 후 친구들과 함께한 파티에서 느낀 점을 부모님께 이야기하고, 대학 생활이나 사회 생활에 대한 기대를 나눕니다.",
      "questions": ["고등학교 졸업을 축하해! 졸업식에서 어떤 감정을 느꼈니?", "대학 진학이나 취업에 대해 어떤 계획을 가지고 있니?", "미래에 어떤 꿈을 이루고 싶니?"]
    }
  ],
  "random_events": [
    {
      "name": "체육대회",
      "min_age": 8,
      "description": "학교에서 열리는 체육대회에 참가합니다. 다양한 운동 종목에서 경쟁하고, 친구들과 함께 즐기며 협동심을 기릅니다. 체육대회에서 어떤 종목에 참가할지 선택하고, 최선을 다해 경쟁하는 경험을 부모님과 공유합니다. 대회에서의 성취와 도전에 대해 이야기합니다.",
      "details": "체육대회에서 친구들과 함께 응원하고, 경기에 참여하며 느꼈던 긴장감과 성취감을 부모님께 이야기합니다.",
      "questions": ["체육대회에서 가장 즐거웠던 순간은 언제였니?", "경기에 참여하며 어떤 감정을 느꼈니?", "다음 체육대회에서는 어떤 목표를 세우고 싶니?"]
    },
    {
      "name": "축제",
      "min_age": 10,
      "description": "학교나 지역사회에서 열리는 축제에 참가합니다. 다양한 활동과 놀이기구, 음식 등을 즐기며 새로운 경험을 합니다. 축제에서 어떤 활동을 할지 선택하고, 그 경험을 부모님과 공유합니다. 축제에서의 즐거운 순간과 배운 점에 대해 이야기합니다.",
      "details": "축제에서 맛본 음식, 즐긴 놀이기구, 참여한 활동 등을 부모님께 이야기합니다.",
      "questions": ["축제에서 가장 즐거웠던 순간은 언제였니?", "새로운 활동을 통해 무엇을 배웠니?", "다음 축제에서는 어떤 것을 더 해보고 싶니?"]
    },
    {
      "name": "첫사랑",
      "min_age": 13,
      "description": "새로운 사람을 만나고 첫사랑의 감정을 경험합니다. 설레고 긴장되는 순간들을 통해 자신의 감정을 배워갑니다. 첫사랑의 감정에 대해 부모님과 대화하고, 그 감정을 어떻게 다룰지 논의합니다. 부모님의 경험과 조언을 듣고, 사랑에 대한 생각을 나눕니다.",
      "details": "첫사랑을 만났던 순간, 느꼈던 감정, 그 사람과의 대화를 부모님께 이야기합니다.",
      "questions": ["첫사랑을 만나게 된 계기는 무엇이니?", "그 사람과의 대화에서 어떤 감정을 느꼈니?", "사랑에 대해 부모님께 궁금한 점이 있니?"]
    },
    {
      "name": "학교 여행",
      "min_age": 10,
      "description": "학교에서 계획된 여행에 참가하여 새로운 장소를 탐험하고 친구들과 함께 시간을 보냅니다. 여행을 통해 다양한 문화와 경험을 접합니다. 여행 중 어떤 활동이 가장 즐거웠는지 부모님과 대화합니다. 여행에서 배운 점과 인상 깊었던 순간을 공유합니다.",
      "details": "여행지에서의 활동, 새로운 경험, 친구들과의 즐거운 순간을 부모님께 이야기합니다.",
      "questions": ["여행 중 가장 기억에 남는 순간은 언제였니?", "새로운 장소에서 무엇을 배웠니?", "다음에는 어떤 여행을 하고 싶니?"]
    },
    {
      "name": "생일 파티",
      "min_age": 6,
      "description": "친구들이나 가족들과 함께 생일을 축하하며 파티를 열고 선물을 받습니다. 파티에서 다양한 게임과 활동을 즐깁니다. 생일 파티에서 가장 기억에 남는 순간을 부모님과 공유합니다. 파티 준비 과정과 받은 선물에 대해 이야기합니다.",
      "details": "파티에서 즐긴 게임, 받은 선물, 친구들과의 즐거운 시간을 부모님께 이야기합니다.",
      "questions": ["생일 파티에서 가장 즐거웠던 순간은 언제였니?", "어떤 선물이 가장 마음에 들었니?", "내년 생일에는 어떤 파티를 하고 싶니?"]
    },
    {
      "name": "가족 여행",
      "min_age": 6,
      "description": "가족과 함께 여행을 떠나 새로운 장소를 탐험하고 가족과 함께 즐거운 시간을 보냅니다. 가족과의 유대감을 강화합니다. 가족 여행 중 가장 기억에 남는 활동을 이야기합니다. 여행지에서의 경험과 가족과의 시간을 공유합니다.",
      "details": "가족과 함께한 여행지의 풍경, 즐긴 활동, 느꼈던 감정을 부모님께 이야기합니다.",
      "questions": ["가족 여행 중 가장 기억에 남는 순간은 언제였니?", "새로운 장소에서 무엇을 배웠니?", "다음 가족 여행에서는 어떤 것을 하고 싶니?"]
    },
    {
      "name": "동아리 활동",
      "min_age": 10,
      "description": "학교에서 동아리 활동에 참여하여 다양한 동아리에 가입하고 활동합니다. 동아리에서 새로운 친구들을 사귀고 다양한 활동을 경험합니다. 동아리 활동에서 무엇을 배웠는지 부모님과 이야기합니다. 동아리 활동의 즐거움과 도전에 대해 공유합니다.",
      "details": "동아리에서 한 활동, 새로 사귄 친구들, 배운 점을 부모님께 이야기합니다.",
      "questions": ["동아리 활동에서 가장 즐거웠던 순간은 언제였니?", "새로 사귄 친구들과 어떤 활동을 했니?", "동아리 활동을 통해 무엇을 배웠니?"]
    },
    {
      "name": "경시대회 참가",
      "min_age": 10,
      "description": "학교나 지역사회에서 열리는 경시대회에 참가하여 학업이나 특정 분야에서 경쟁합니다. 대회를 준비하며 자신의 능력을 시험합니다. 경시대회 준비 과정과 결과에 대해 부모님과 논의합니다. 대회를 통해 배운 점과 성취감을 공유합니다.",
      "details": "대회를 준비하며 느꼈던 긴장감, 대회에서의 경험, 성취감을 부모님께 이야기합니다.",
      "questions": ["경시대회에서 가장 기억에 남는 순간은 언제였니?", "대회를 준비하며 어떤 점이 어려웠니?", "다음 경시대회에서는 어떤 목표를 세우고 싶니?"]
    },
    {
      "name": "친구와 갈등",
      "min_age": 10,
      "description": "친구와의 갈등을 겪고 문제를 해결하여 관계를 회복합니다. 갈등을 통해 사회적 기술과 문제 해결 능력을 배웁니다. 친구와의 갈등을 어떻게 해결했는지 부모님과 이야기합니다. 갈등 해결 과정에서 배운 점과 감정을 공유합니다.",
      "details": "친구와의 갈등이 발생한 상황, 그때 느꼈던 감정, 갈등을 해결한 방법을 부모님께 이야기합니다.",
      "questions": ["친구와의 갈등에서 가장 어려웠던 점은 무엇이니?", "갈등을 해결하면서 어떤 점을 배웠니?", "다음에 비슷한 상황이 발생하면 어떻게 대처하고 싶니?"]
    },
    {
      "name": "새로운 친구 사귀기",
      "min_age": 6,
      "description": "새로운 친구를 사귀고 새로운 사람을 만나 관계를 형성합니다. 친구 사귀기를 통해 사회성을 기릅니다. 새로운 친구와의 만남과 그 과정에 대해 부모님과 이야기합니다. 새로운 친구와의 경험과 느낀 점을 공유합니다.",
      "details": "새로운 친구를 만난 상황, 친구와 함께한 활동, 느꼈던 감정을 부모님께 이야기합니다.",
      "questions": ["새로운 친구를 사귀면서 가장 기뻤던 순간은 언제였니?", "친구와 함께 어떤 활동을 했니?", "새로운 친구와의 관계를 유지하기 위해 어떤 노력을 하고 싶니?"]
    },
    {
      "name": "동아리 리더 선출",
      "min_age": 12,
      "description": "동아리에서 리더로 선출되어 활동을 이끌어갑니다. 리더십을 발휘하며 팀을 이끄는 경험을 합니다. 동아리 리더로서의 역할과 책임에 대해 부모님과 논의합니다. 리더로서의 도전과 성취를 공유합니다.",
      "details": "리더로 선출된 과정, 팀을 이끌며 느꼈던 책임감과 성취감을 부모님께 이야기합니다.",
      "questions": ["리더로 선출되었을 때 어떤 기분이었니?", "팀을 이끌면서 가장 어려웠던 점은 무엇이었니?", "리더로서 팀을 위해 어떤 노력을 하고 싶니?"]
    },
    {
      "name": "학교 프로젝트",
      "min_age": 14,
      "description": "학교 프로젝트에 참여하여 팀원들과 협력합니다. 프로젝트를 통해 협동심과 문제 해결 능력을 기릅니다. 프로젝트 팀원들과의 협력 과정과 결과에 대해 부모님과 이야기합니다. 프로젝트에서 배운 점과 성취감을 공유합니다.",
      "details": "프로젝트 주제, 팀원들과의 협력 과정, 프로젝트 결과를 부모님께 이야기합니다.",
      "questions": ["프로젝트에서 가장 인상 깊었던 순간은 언제였니?", "팀원들과의 협력이 잘 이루어졌니?", "다음 프로젝트에서는 어떤 점을 개선하고 싶니?"]
    },
    {
      "name": "대회 우승",
      "min_age": 15,
      "description": "학교나 지역 대회에서 우승을 차지합니다. 대회를 준비하며 자신의 능력을 시험하고 성취감을 느낍니다. 대회에서 우승한 경험과 그 과정에 대해 부모님과 이야기합니다. 우승의 기쁨과 배운 점을 공유합니다.",
      "details": "대회를 준비하며 느꼈던 긴장감, 대회에서의 경험, 성취감을 부모님께 이야기합니다.",
      "questions": ["대회에서 우승했을 때 어떤 기분이었니?", "대회를 준비하면서 가장 어려웠던 점은 무엇이었니?", "다음 대회에서는 어떤 목표를 세우고 싶니?"]
    },
    {
      "name": "봉사 활동",
      "min_age": 15,
      "description": "학교나 지역사회에서 봉사 활동에 참여합니다. 봉사를 통해 나눔의 기쁨을 배우고 사회에 기여합니다. 봉사 활동을 통해 느낀 점과 배운 점에 대해 부모님과 이야기합니다. 봉사 활동의 의미와 성취감을 공유합니다.",
      "details": "봉사 활동을 하며 만난 사람들, 봉사 활동의 경험, 느꼈던 감정을 부모님께 이야기합니다.",
      "questions": ["봉사 활동을 하며 가장 기억에 남는 순간은 언제였니?", "봉사를 통해 무엇을 배웠니?", "다음에는 어떤 봉사 활동을 하고 싶니?"]
    },
    {
      "name": "알바 시작",
      "min_age": 17,
      "description": "첫 아르바이트를 시작합니다. 일을 통해 사회 경험을 쌓고 돈의 가치를 배웁니다. 아르바이트 경험과 그 과정에서 배운 점을 부모님과 이야기합니다. 일의 의미와 책임감을 공유합니다.",
      "details": "아르바이트를 시작한 이유, 일하면서 느꼈던 감정, 배운 점을 부모님께 이야기합니다.",
      "questions": ["첫 아르바이트를 시작했을 때 어떤 기분이었니?", "일을 하면서 가장 어려웠던 점은 무엇이었니?", "아르바이트를 통해 무엇을 배웠니?"]
    },
    {
      "name": "부모님과의 갈등",
      "min_age": 12,
      "description": "부모님과의 갈등을 겪고 해결하는 경험을 합니다. 갈등을 통해 부모님과의 관계를 더욱 이해하고 발전시킵니다. 부모님과 솔직한 대화를 나누고, 서로의 입장을 이해하여 갈등을 해결합니다. 갈등 해결 과정에서 배운 점과 느낀 점을 공유합니다.",
      "details": "부모님과의 갈등이 발생한 상황, 그때 느꼈던 감정, 갈등을 해결한 방법을 부모님께 이야기합니다.",
      "questions": ["부모님과의 갈등에서 가장 어려웠던 점은 무엇이었니?", "갈등을 해결하면서 어떤 점을 배웠니?", "다음에 비슷한 상황이 발생하면 어떻게 대처하고 싶니?"]
    },
    {
      "name": "부모님과의 진로 상담",
      "min_age": 15,
      "description": "부모님과 진로에 대해 상담하고 결정합니다. 진로 선택 과정에서 부모님의 조언과 지원을 받습니다. 부모님과 진로에 대한 진지한 대화를 나누고, 고민을 공유하여 최선의 결정을 내립니다. 부모님의 경험과 조언을 듣고 진로에 대한 생각을 나눕니다.",
      "details": "진로에 대한 고민, 부모님과의 상담 과정, 느꼈던 감정을 부모님께 이야기합니다.",
      "questions": ["진로에 대해 가장 고민되는 점은 무엇이니?", "부모님께 어떤 조언을 듣고 싶니?", "진로를 결정하면서 어떤 목표를 세우고 싶니?"]
    },
    {
      "name": "학원 및 공부 스트레스",
      "min_age": 7,
      "description": "학원 및 공부로 인한 스트레스를 경험하고 극복합니다. 스트레스 관리와 학습 방법을 배웁니다. 스트레스 해소를 위해 부모님과 대화를 나누고, 휴식 시간을 가지며 공부와의 균형을 맞춥니다. 스트레스 관리 방법과 느낀 점을 공유합니다.",
      "details": "학원이나 공부로 인해 스트레스를 받은 상황, 그때 느꼈던 감정, 스트레스를 해소한 방법을 부모님께 이야기합니다.",
      "questions": ["학원이나 공부로 인해 가장 스트레스를 받았던 순간은 언제였니?", "스트레스를 해소하기 위해 어떤 방법을 사용했니?", "공부와 휴식을 어떻게 균형 있게 맞추고 싶니?"]
    },
    {
      "name": "처음 부모님과 음주",
      "min_age": 19,
      "description": "성인이 되어 처음으로 부모님과 함께 음주를 경험합니다. 책임감 있는 음주 습관을 배웁니다. 책임감 있는 음주 습관과 음주의 위험성에 대해 부모님과 대화합니다. 부모님의 경험을 듣고, 음주에 대한 생각을 나눕니다.",
      "details": "부모님과 함께한 첫 음주 경험, 느꼈던 감정, 음주에 대한 생각을 부모님께 이야기합니다.",
      "questions": ["처음 음주를 경험했을 때 어떤 기분이었니?", "음주에 대해 부모님께 궁금한 점이 있니?", "책임감 있는 음주 습관을 어떻게 지키고 싶니?"]
    },
    {
      "name": "과학 박람회 참가",
      "min_age": 10,
      "description": "학교에서 열리는 과학 박람회에 참가하여 자신의 과학 프로젝트를 발표하고 다른 학생들과 경쟁합니다. 과학적 탐구와 발표 능력을 기릅니다. 과학 프로젝트 준비 과정과 발표 경험을 부모님과 공유합니다. 과학 박람회에서 배운 점과 성취감을 나눕니다.",
      "details": "과학 박람회에서 발표한 주제, 준비 과정, 느꼈던 감정을 부모님께 이야기합니다.",
      "questions": ["과학 박람회에서 가장 기억에 남는 순간은 언제였니?", "프로젝트를 준비하면서 가장 어려웠던 점은 무엇이었니?", "다음 과학 박람회에서는 어떤 주제로 발표하고 싶니?"]
    }
  ]
}
